var Map_olx_sub_cat =
    [
        [
            ["Квартиры посуточно", "Квартиры с почасовой оплатой", "Долгосрочная аренда квартир"],
            ["Долгосрочная аренда домов", "Дома посуточно / почасово"],
            ["Койко-места", "Комнаты посуточно", "Долгосрочная аренда комнат"],
            "",
            "",
            ["Аренда магазинов / салонов", "Аренда ресторанов / баров", "Аренда офисов", "Аренда складов", "Аренда отдельно стоящих зданий", "Аренда баз отдыха", "Аренда помещений промышленного назначения", "Аренда помещений свободного назначения", "Прочее"]
        ],
        [
            ["Вторичный рынок", "Новостройки"],
            ["Продажа домов в городе", "Продажа домов за городом", "Продажа дач"],
            "",
            ["Земля под индивидуальное строительство", "Земля под сад / огород", "Земля сельскохозяйственного назначения", "Земля промышленного назначения"],
            "",
            ["Продажа магазинов / салонов", "Продажа ресторанов / баров", "Продажа офисов", "Продажа складов", "Продажа отдельно стоящих зданий", "Продажа баз отдыха", "Продажа помещений промышленного назначения", "Продажа помещений свободного назначения"]
        ]
    ];

var Map_field_require = ['remote_input', 'building_type_input', 'rent_from_input', 'rooms_input', 'full_square_input', 'live_square_input', 'kitchen_square_input', 'floor_input', 'max_floor_input'];

//  remote  --  type  --  rent-from  --  rooms  --  all_space  --  live_space  --  kitchen_space  --  current_floor  --  max_floor
//  0 -- not visible   1 -- visible  2 -- required

var Map_olx_field =
    [
        [
            ["010211021", "012200000", "010200000"],
            ["100010000", "100010000"],
            ["000200000", "000200000", "000200000"],
            "100000000",
            "000000000",
            ["000020000", "000020000", "000020000", "000020000", "000020000", "000020000", "000020000", "000020000", "000020000"]
        ],
        [
            ["010211121", "010211121"],
            ["100010000", "100010000", "100010000"],
            "000211121",
            ["100020000", "100020000", "100020000", "100020000"],
            "000000000",
            ["000020000", "000020000", "000020000", "000020000", "000020000", "000020000", "000020000", "000020000"]
        ]
    ];

var Map_olx_cat =
    [
        "Квартиры",
        "Дома",
        "Комнаты",
        "Земля"//,
        //"Гаражи / Стоянки",
        //"Помещение"
    ];

var Map_olx_directs =
    [
        ["Голосеевский", "Дарницкий", "Деснянский", "Днепровский", "Оболонский", "Печерский", "Подольский", "Святошинский", "Соломенский", "Шевченковский"],
        ["Барышевский", "Белоцерковский", "Богуславский", "Бориспольский", "Бородянский", "Броварской", "Васильковский", "Володарский", "Вышгородский",
            "Згуровский", "Иванковский", "Кагарлыкский", "Киево-Святошинский", "Макаровский", "Мироновский", "Обуховский", "Переяслав-Хмельницкий", "Полесский",
            "Ракитнянский", "Сквирский", "Ставищенский", "Таращанский", "Тетиевский", "Фастовский", "Яготинский"]
    ];

var Map_olx_city =
    [
        ["Киев", "Киев", "Киев", "Киев", "Киев", "Киев", "Киев", "Киев", "Киев", "Киев"],
        ["Барышевка", "Белая Церковь", "Богуслав", "Борисполь", "Бородянка", "Бровары", "Васильков", "Володарка", "Вышгород", "Згуровский", "Иванков",
            "Кагарлык", "Киево-Святошинский", "Макаров", "Мироновка", "Обухов", "Переяслав-Хмельницкий", "Полесский", "Рокитное", "Сквира", "Ставищенский",
            "Тараща", "Тетиев", "Фастов", "Яготин"]
    ];

var Map_currency = ["&#8372;", "&#36;", "&#8364;"];

var Map_type = ["Кирпичный", "Панельный", "Монолитный", "Блочный", "Деревянный"];

var Map_post = ["Не опубликовано", "Не активен", "Модерирование", "Активное", "Ошибка"];

var Map_post_light = ["red", "lightcoral", "orange", "green", "red"];
var Map_sites = [
    "olx.ua",
    "fn.ua",
    "aviso.ua",
    "address.ua",
    "mirkvartir.ua"
];

var Map_search_query = [
    ['type_input', 'adv_type', ''],
    ['site_input', 'site', ''],
    ['category_input', 'building.0', ''],
    ['cur_price_input', 'currency', ''],
    ['sub_category_input', 'building.1', ''],
    ['city_input', 'location.2', ''],
    ['title_input', 'title', '$regex'],
    ['name_input', 'name', '$regex'],
    ['telephone_input', 'telephone', '$regex'],
    ['from_square_input', 'space.0', '$gt'],
    ['to_square_input', 'space.0', '$lt'],
    ['from_rooms_input', 'rooms', '$gt'],
    ['to_rooms_input', 'rooms', '$lt'],
    ['from_price_input', 'price', '$gt'],
    ['to_price_input', 'price', '$lt']
];


var Map_max_articles =
    {
        "olx_ua": 3,
         "fn_ua": 0,
         "aviso_ua": 0,
         "address_ua": 0,
         "mirkvartir_ua": 0
    };

var map_field =
    [
        ['title_input:input', 'title', /^.{30,70}$/i],
        ['price_input:input', 'price', /^\d+$/],
        ['description_input:textarea', 'description', /^.{100,2000}$/i],
        ['telephone_input:input', 'telephone', /^([\+]?[(]?[0-9]{3}[)]?[-\s\.]?[0-9]{3}[-\s\.]?[0-9]{4,6}|.{0})$/im],
        ['rent_from_input:input', 'rent_from', /^(\d{4}-\d{2}-\d{2}|.{0})$/],
        ['name_input:input', 'name'],
        ['remote_input:input', 'remote', /^\d*$/],
        ['rooms_input:input', 'rooms', /^\d*$/],
        ['skype_input:input', 'skype', /^.{5,}$/],
        ['per_name_input:input', 'per_name'],
        ['per_telephone_input:input', 'per_telephone', /^([\+]?[(]?[0-9]{3}[)]?[-\s\.]?[0-9]{3}[-\s\.]?[0-9]{4,6}|.{0})$/im],
        ['address_input:input', 'location:3'],
        ['city_input:input', 'location:2'],
        ['full_square_input:input', 'space:0', /^\d*$/],
        ['live_square_input:input', 'space:1', /^\d*$/],
        ['kitchen_square_input:input', 'space:2', /^\d*$/],
        ['floor_input:input', 'floor:0', /^\d*$/],
        ['max_floor_input:input', 'floor:1', /^\d*$/],
        ['site_input:select', 'site', /^.+$/],
        ['type_input:select', 'adv_type', /^\d+$/],
        ['building_type_input:select', 'type'],
        ['cur_price_input:select', 'currency', /^\d+$/],
        ['location_input:select', 'location:0', /^\d+$/],
        ['category_input:select', 'building:0', /^\d+$/],
        ['sub_category_input:select', 'building:1', /^\d+$/]
    ];